Rafa350/EOS/v2/Include/HTL/STM32/htlGPIO.h
#pragma once
/// \file      halGPIO_ex.h
/// \author    Rafael Serrano (rsr.openware@gmail.com)
/// \brief     GPIO module manager.
/// \addtogroup HTL HAL Template Library
/// @{
/// \addtogroup HTL_STM32 STM32
/// @{
/// \defgroup HTL_STM32_GPIO GPIO
/// @{
#ifndef __STM32_htlGPIO__
#define __STM32_htlGPIO__


// EOS includes
//
#include "HTL/htl.h"


namespace htl {

    /// \brief Port identifiers.
    enum class GPIOPort {
        #ifdef GPIOA_BASE
            A,
        #endif
        #ifdef GPIOB_BASE
            B,
        #endif
        #ifdef GPIOC_BASE
            C,
        #endif
        #ifdef GPIOD_BASE
            D,
        #endif
        #ifdef GPIOE_BASE
            E,
        #endif
        #ifdef GPIOF_BASE
            F,
        #endif
        #ifdef GPIOG_BASE
            G,
        #endif
        #ifdef GPIOH_BASE
            H,
        #endif
        #ifdef GPIOI_BASE
            I,
        #endif
        #ifdef GPIOJ_BASE
            J,
        #endif
        #ifdef GPIOK_BASE
            K,
        #endif
    };

    /// \brief Pin identifiers.
    enum class GPIOPin {
        _0,
        _1,
        _2,
        _3,
        _4,
        _5,
        _6,
        _7,
        _8,
        _9,
        _10,
        _11,
        _12,
        _13,
        _14,
        _15
    };

    /// \brief Alternate function identifiers
    enum class GPIOAlt {
    	_0,
    	_1,
    	_2,
    	_3,
    	_4,
    	_5,
    	_6,
    	_7,
    	_8,
    	_9,
		_10,
    	_11,
    	_12,
    	_13,
    	_14,
		_15
    };

    /// \brief Pull up/down mode identifier.
    enum class GPIOPull {
    	noChange,
        none,
        up,
        down
    };

    /// \brief Driver type identifier.
    enum class GPIODriver {
    	noChange,
        pushPull,
        openDrain
    };

    /// \brief Speed identifier.
    enum class GPIOSpeed {
    	noChange,
        low,
        medium,
        high,
        fast
    };

    enum class GPIOState {
		clear,
    	set
    };

    template <GPIOPort>
    struct GPIOPortTrait {
    };

    template <GPIOPort, GPIOPin>
    struct GPIOPinTrait {
    };

    template <GPIOPort port_>
    class GPIOPortActivator final {
    	private:
    		static uint16_t _activated;

    	public:
    		static void activate(
    			uint16_t mask) {

    			if (!_activated) {
    				if constexpr (port_ == GPIOPort::A)
    					RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;
    				if constexpr (port_ == GPIOPort::B)
    					RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;
    				if constexpr (port_ == GPIOPort::C)
    					RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN;
    				if constexpr (port_ == GPIOPort::D)
    					RCC->AHB1ENR |= RCC_AHB1ENR_GPIODEN;
    				if constexpr (port_ == GPIOPort::E)
    					RCC->AHB1ENR |= RCC_AHB1ENR_GPIOEEN;
    				if constexpr (port_ == GPIOPort::F)
    					RCC->AHB1ENR |= RCC_AHB1ENR_GPIOFEN;
    				if constexpr (port_ == GPIOPort::G)
    					RCC->AHB1ENR |= RCC_AHB1ENR_GPIOGEN;
    				if constexpr (port_ == GPIOPort::H)
    					RCC->AHB1ENR |= RCC_AHB1ENR_GPIOHEN;
    				if constexpr (port_ == GPIOPort::I)
    					RCC->AHB1ENR |= RCC_AHB1ENR_GPIOIEN;
    				if constexpr (port_ == GPIOPort::J)
    					RCC->AHB1ENR |= RCC_AHB1ENR_GPIOJEN;
    				if constexpr (port_ == GPIOPort::K)
    					RCC->AHB1ENR |= RCC_AHB1ENR_GPIOKEN;
    				__DSB();
    			}
    			_activated |= mask;
    		}

    		static void deactivate(
    			uint16_t mask) {

    			_activated &= ~mask;
    			if (!_activated) {
    				if constexpr (port_ == GPIOPort::A)
    					RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOAEN;
    				if constexpr (port_ == GPIOPort::B)
    					RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOBEN;
    				if constexpr (port_ == GPIOPort::C)
    					RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOCEN;
    				if constexpr (port_ == GPIOPort::D)
    					RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIODEN;
    				if constexpr (port_ == GPIOPort::E)
    					RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOEEN;
    				if constexpr (port_ == GPIOPort::F)
    					RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOFEN;
    				if constexpr (port_ == GPIOPort::G)
    					RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOGEN;
    				if constexpr (port_ == GPIOPort::H)
    					RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOHEN;
    				if constexpr (port_ == GPIOPort::I)
    					RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOIEN;
    				if constexpr (port_ == GPIOPort::J)
    					RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOJEN;
    				if constexpr (port_ == GPIOPort::K)
    					RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOKEN;
    			}
    		}
    };

    template <GPIOPort port_> uint16_t GPIOPortActivator<port_>::_activated = 0;


    /// \class GPIOBase_x
    /// \brief Base class for gpio
    ///
    class GPIOBase_x {
    	protected:
			static void initInput(GPIO_TypeDef *regs, uint32_t pn, GPIOPull pullMode);
			static void initOutput(GPIO_TypeDef *regs, uint32_t pn, GPIODriver driver, GPIOSpeed speed);
			static void initAlt(GPIO_TypeDef *regs, uint32_t pn, GPIODriver driver, GPIOSpeed speed, GPIOAlt alt);
    };

    /// \class GPIO_x
    /// \brief Class for gpio pins
    ///
    template <GPIOPort port_, GPIOPin pin_>
    class GPIO_x final: public GPIOBase_x {
        private:
            using PortTrait = GPIOPortTrait<port_>;
            using PinTrait = GPIOPinTrait<port_, pin_>;
            using Activator = GPIOPortActivator<port_>;
            static constexpr uint32_t _addr = PortTrait::addr;
            static constexpr uint32_t _pn = PinTrait::pn;

        public:
            static constexpr GPIOPort port = port_;
            static constexpr GPIOPin pin = pin_;

        private:
            GPIO_x() = delete;
            GPIO_x(const GPIO_x &) = delete;
            GPIO_x(const GPIO_x &&) = delete;
            ~GPIO_x() = delete;

            GPIO_x & operator = (const GPIO_x &) = delete;
            GPIO_x & operator = (const GPIO_x &&) = delete;

        public:
            /// \brief Inicialkitza el pin com entrada.
            /// \param pull: Opcions de pull up/down
            ///
            static void initInput(
            	GPIOPull pull = GPIOPull::none) {

            	Activator::activate(1 << _pn);
            	GPIOBase_x::initInput(
                    reinterpret_cast<GPIO_TypeDef*>(_addr), 
                    _pn,
                    pull);
            }

            /// \brief Inicialitza el pin com a sortida.
            /// \param driver: Opcions de driver
            /// \param speed: Opcions de velocitat.
            ///
            static void initOutput(
            	GPIODriver driver,
				GPIOSpeed speed = GPIOSpeed::medium) {

            	Activator::activate(1 << _pn);
            	GPIOBase_x::initOutput(
                    reinterpret_cast<GPIO_TypeDef*>(_addr),
                    _pn,
                    driver,
                    speed);
            }

