Rafa350/EOS/v2/Include/HTL/STM32/htlGPIO.h
            static void initAlt(
            	GPIODriver driver,
				GPIOSpeed speed,
				GPIOAlt alt) {
                
            	Activator::activate(1 << _pn);
            	GPIOBase_x::initAlt(
                    reinterpret_cast<GPIO_TypeDef*>(_addr),
                    _pn,
                    driver,
                    speed,
					alt);
            }

            /// \brief Desinicialitza el pin.
            ///
            static void deinitialize() {

            	Activator::deactivate(1 << _pn);
            }

            /// \brief Set pin to ON state.
            ///
            inline static void set() {

                GPIO_TypeDef *regs = reinterpret_cast<GPIO_TypeDef*>(_addr);
                regs->BSRR = 1 << _pn;
            }

            /// \brief Set pin to OFF state.
            ///
            inline static void clear() {

                GPIO_TypeDef *regs = reinterpret_cast<GPIO_TypeDef*>(_addr);
                regs->BSRR = 1 << (_pn + 16);
            }

            /// \brief Toggle pin state.
            ///
            inline static void toggle() {

                GPIO_TypeDef *regs = reinterpret_cast<GPIO_TypeDef*>(_addr);
                regs->ODR ^= 1 << _pn;
            }

            /// \brief Read pin state
            /// \return Pin state.
            ///
            inline static GPIOState read() {

                GPIO_TypeDef *regs = reinterpret_cast<GPIO_TypeDef*>(_addr);
                return ((regs->IDR & (1 << _pn)) == 0) ? GPIOState::clear : GPIOState::set;
            }

            /// \brief Write pin state.
            /// \param state: State to write.
            ///
            inline static void write(
            	GPIOState state) {

                GPIO_TypeDef *regs = reinterpret_cast<GPIO_TypeDef*>(_addr);
                regs->BSRR = 1 << (_pn + (state == GPIOState::set ? 0 : 16));
            }
    };

    #ifdef GPIOA_BASE
        typedef GPIO_x<GPIOPort::A, GPIOPin::_0> GPIO_A0;
        typedef GPIO_x<GPIOPort::A, GPIOPin::_1> GPIO_A1;
        typedef GPIO_x<GPIOPort::A, GPIOPin::_2> GPIO_A2;
        typedef GPIO_x<GPIOPort::A, GPIOPin::_3> GPIO_A3;
        typedef GPIO_x<GPIOPort::A, GPIOPin::_4> GPIO_A4;
        typedef GPIO_x<GPIOPort::A, GPIOPin::_5> GPIO_A5;
        typedef GPIO_x<GPIOPort::A, GPIOPin::_6> GPIO_A6;
        typedef GPIO_x<GPIOPort::A, GPIOPin::_7> GPIO_A7;
        typedef GPIO_x<GPIOPort::A, GPIOPin::_8> GPIO_A8;
        typedef GPIO_x<GPIOPort::A, GPIOPin::_9> GPIO_A9;
        typedef GPIO_x<GPIOPort::A, GPIOPin::_10> GPIO_A10;
        typedef GPIO_x<GPIOPort::A, GPIOPin::_11> GPIO_A11;
        typedef GPIO_x<GPIOPort::A, GPIOPin::_12> GPIO_A12;
        typedef GPIO_x<GPIOPort::A, GPIOPin::_13> GPIO_A13;
        typedef GPIO_x<GPIOPort::A, GPIOPin::_14> GPIO_A14;
        typedef GPIO_x<GPIOPort::A, GPIOPin::_15> GPIO_A15;
    #endif

    #ifdef GPIOB_BASE
        typedef GPIO_x<GPIOPort::B, GPIOPin::_0> GPIO_B0;
        typedef GPIO_x<GPIOPort::B, GPIOPin::_1> GPIO_B1;
        typedef GPIO_x<GPIOPort::B, GPIOPin::_2> GPIO_B2;
        typedef GPIO_x<GPIOPort::B, GPIOPin::_3> GPIO_B3;
        typedef GPIO_x<GPIOPort::B, GPIOPin::_4> GPIO_B4;
        typedef GPIO_x<GPIOPort::B, GPIOPin::_5> GPIO_B5;
        typedef GPIO_x<GPIOPort::B, GPIOPin::_6> GPIO_B6;
        typedef GPIO_x<GPIOPort::B, GPIOPin::_7> GPIO_B7;
        typedef GPIO_x<GPIOPort::B, GPIOPin::_8> GPIO_B8;
        typedef GPIO_x<GPIOPort::B, GPIOPin::_9> GPIO_B9;
        typedef GPIO_x<GPIOPort::B, GPIOPin::_10> GPIO_B10;
        typedef GPIO_x<GPIOPort::B, GPIOPin::_11> GPIO_B11;
        typedef GPIO_x<GPIOPort::B, GPIOPin::_12> GPIO_B12;
        typedef GPIO_x<GPIOPort::B, GPIOPin::_13> GPIO_B13;
        typedef GPIO_x<GPIOPort::B, GPIOPin::_14> GPIO_B14;
        typedef GPIO_x<GPIOPort::B, GPIOPin::_15> GPIO_B15;
    #endif

    #ifdef GPIOC_BASE
        typedef GPIO_x<GPIOPort::C, GPIOPin::_0> GPIO_C0;
        typedef GPIO_x<GPIOPort::C, GPIOPin::_1> GPIO_C1;
        typedef GPIO_x<GPIOPort::C, GPIOPin::_2> GPIO_C2;
        typedef GPIO_x<GPIOPort::C, GPIOPin::_3> GPIO_C3;
        typedef GPIO_x<GPIOPort::C, GPIOPin::_4> GPIO_C4;
        typedef GPIO_x<GPIOPort::C, GPIOPin::_5> GPIO_C5;
        typedef GPIO_x<GPIOPort::C, GPIOPin::_6> GPIO_C6;
        typedef GPIO_x<GPIOPort::C, GPIOPin::_7> GPIO_C7;
        typedef GPIO_x<GPIOPort::C, GPIOPin::_8> GPIO_C8;
        typedef GPIO_x<GPIOPort::C, GPIOPin::_9> GPIO_C9;
        typedef GPIO_x<GPIOPort::C, GPIOPin::_10> GPIO_C10;
        typedef GPIO_x<GPIOPort::C, GPIOPin::_11> GPIO_C11;
        typedef GPIO_x<GPIOPort::C, GPIOPin::_12> GPIO_C12;
        typedef GPIO_x<GPIOPort::C, GPIOPin::_13> GPIO_C13;
        typedef GPIO_x<GPIOPort::C, GPIOPin::_14> GPIO_C14;
        typedef GPIO_x<GPIOPort::C, GPIOPin::_15> GPIO_C15;
    #endif

    #ifdef GPIOD_BASE
        typedef GPIO_x<GPIOPort::D, GPIOPin::_0> GPIO_D0;
        typedef GPIO_x<GPIOPort::D, GPIOPin::_1> GPIO_D1;
        typedef GPIO_x<GPIOPort::D, GPIOPin::_2> GPIO_D2;
        typedef GPIO_x<GPIOPort::D, GPIOPin::_3> GPIO_D3;
        typedef GPIO_x<GPIOPort::D, GPIOPin::_4> GPIO_D4;
        typedef GPIO_x<GPIOPort::D, GPIOPin::_5> GPIO_D5;
        typedef GPIO_x<GPIOPort::D, GPIOPin::_6> GPIO_D6;
        typedef GPIO_x<GPIOPort::D, GPIOPin::_7> GPIO_D7;
        typedef GPIO_x<GPIOPort::D, GPIOPin::_8> GPIO_D8;
        typedef GPIO_x<GPIOPort::D, GPIOPin::_9> GPIO_D9;
        typedef GPIO_x<GPIOPort::D, GPIOPin::_10> GPIO_D10;
        typedef GPIO_x<GPIOPort::D, GPIOPin::_11> GPIO_D11;
        typedef GPIO_x<GPIOPort::D, GPIOPin::_12> GPIO_D12;
        typedef GPIO_x<GPIOPort::D, GPIOPin::_13> GPIO_D13;
        typedef GPIO_x<GPIOPort::D, GPIOPin::_14> GPIO_D14;
        typedef GPIO_x<GPIOPort::D, GPIOPin::_15> GPIO_D15;
    #endif

    #ifdef GPIOE_BASE
        typedef GPIO_x<GPIOPort::E, GPIOPin::_0> GPIO_E0;
        typedef GPIO_x<GPIOPort::E, GPIOPin::_1> GPIO_E1;
        typedef GPIO_x<GPIOPort::E, GPIOPin::_2> GPIO_E2;
        typedef GPIO_x<GPIOPort::E, GPIOPin::_3> GPIO_E3;
        typedef GPIO_x<GPIOPort::E, GPIOPin::_4> GPIO_E4;
        typedef GPIO_x<GPIOPort::E, GPIOPin::_5> GPIO_E5;
        typedef GPIO_x<GPIOPort::E, GPIOPin::_6> GPIO_E6;
        typedef GPIO_x<GPIOPort::E, GPIOPin::_7> GPIO_E7;
        typedef GPIO_x<GPIOPort::E, GPIOPin::_8> GPIO_E8;
        typedef GPIO_x<GPIOPort::E, GPIOPin::_9> GPIO_E9;
        typedef GPIO_x<GPIOPort::E, GPIOPin::_10> GPIO_E10;
        typedef GPIO_x<GPIOPort::E, GPIOPin::_11> GPIO_E11;
        typedef GPIO_x<GPIOPort::E, GPIOPin::_12> GPIO_E12;
        typedef GPIO_x<GPIOPort::E, GPIOPin::_13> GPIO_E13;
        typedef GPIO_x<GPIOPort::E, GPIOPin::_14> GPIO_E14;
        typedef GPIO_x<GPIOPort::E, GPIOPin::_15> GPIO_E15;
    #endif

