Rafa350/EOS/v2/Include/HTL/STM32/htlGPIO.h
    #ifdef GPIOF_BASE
        typedef GPIO_x<GPIOPort::F, GPIOPin::_0> GPIO_F0;
        typedef GPIO_x<GPIOPort::F, GPIOPin::_1> GPIO_F1;
        typedef GPIO_x<GPIOPort::F, GPIOPin::_2> GPIO_F2;
        typedef GPIO_x<GPIOPort::F, GPIOPin::_3> GPIO_F3;
        typedef GPIO_x<GPIOPort::F, GPIOPin::_4> GPIO_F4;
        typedef GPIO_x<GPIOPort::F, GPIOPin::_5> GPIO_F5;
        typedef GPIO_x<GPIOPort::F, GPIOPin::_6> GPIO_F6;
        typedef GPIO_x<GPIOPort::F, GPIOPin::_7> GPIO_F7;
        typedef GPIO_x<GPIOPort::F, GPIOPin::_8> GPIO_F8;
        typedef GPIO_x<GPIOPort::F, GPIOPin::_9> GPIO_F9;
        typedef GPIO_x<GPIOPort::F, GPIOPin::_10> GPIO_F10;
        typedef GPIO_x<GPIOPort::F, GPIOPin::_11> GPIO_F11;
        typedef GPIO_x<GPIOPort::F, GPIOPin::_12> GPIO_F12;
        typedef GPIO_x<GPIOPort::F, GPIOPin::_13> GPIO_F13;
        typedef GPIO_x<GPIOPort::F, GPIOPin::_14> GPIO_F14;
        typedef GPIO_x<GPIOPort::F, GPIOPin::_15> GPIO_F15;
    #endif

    #ifdef GPIOG_BASE
        typedef GPIO_x<GPIOPort::G, GPIOPin::_0> GPIO_G0;
        typedef GPIO_x<GPIOPort::G, GPIOPin::_1> GPIO_G1;
        typedef GPIO_x<GPIOPort::G, GPIOPin::_2> GPIO_G2;
        typedef GPIO_x<GPIOPort::G, GPIOPin::_3> GPIO_G3;
        typedef GPIO_x<GPIOPort::G, GPIOPin::_4> GPIO_G4;
        typedef GPIO_x<GPIOPort::G, GPIOPin::_5> GPIO_G5;
        typedef GPIO_x<GPIOPort::G, GPIOPin::_6> GPIO_G6;
        typedef GPIO_x<GPIOPort::G, GPIOPin::_7> GPIO_G7;
        typedef GPIO_x<GPIOPort::G, GPIOPin::_8> GPIO_G8;
        typedef GPIO_x<GPIOPort::G, GPIOPin::_9> GPIO_G9;
        typedef GPIO_x<GPIOPort::G, GPIOPin::_10> GPIO_G10;
        typedef GPIO_x<GPIOPort::G, GPIOPin::_11> GPIO_G11;
        typedef GPIO_x<GPIOPort::G, GPIOPin::_12> GPIO_G12;
        typedef GPIO_x<GPIOPort::G, GPIOPin::_13> GPIO_G13;
        typedef GPIO_x<GPIOPort::G, GPIOPin::_14> GPIO_G14;
        typedef GPIO_x<GPIOPort::G, GPIOPin::_15> GPIO_G15;
    #endif

    #ifdef GPIOH_BASE
        typedef GPIO_x<GPIOPort::H, GPIOPin::_0> GPIO_H0;
        typedef GPIO_x<GPIOPort::H, GPIOPin::_1> GPIO_H1;
        typedef GPIO_x<GPIOPort::H, GPIOPin::_2> GPIO_H2;
        typedef GPIO_x<GPIOPort::H, GPIOPin::_3> GPIO_H3;
        typedef GPIO_x<GPIOPort::H, GPIOPin::_4> GPIO_H4;
        typedef GPIO_x<GPIOPort::H, GPIOPin::_5> GPIO_H5;
        typedef GPIO_x<GPIOPort::H, GPIOPin::_6> GPIO_H6;
        typedef GPIO_x<GPIOPort::H, GPIOPin::_7> GPIO_H7;
        typedef GPIO_x<GPIOPort::H, GPIOPin::_8> GPIO_H8;
        typedef GPIO_x<GPIOPort::H, GPIOPin::_9> GPIO_H9;
        typedef GPIO_x<GPIOPort::H, GPIOPin::_10> GPIO_H10;
        typedef GPIO_x<GPIOPort::H, GPIOPin::_11> GPIO_H11;
        typedef GPIO_x<GPIOPort::H, GPIOPin::_12> GPIO_H12;
        typedef GPIO_x<GPIOPort::H, GPIOPin::_13> GPIO_H13;
        typedef GPIO_x<GPIOPort::H, GPIOPin::_14> GPIO_H14;
        typedef GPIO_x<GPIOPort::H, GPIOPin::_15> GPIO_H15;
    #endif

    #ifdef GPIOI_BASE
        typedef GPIO_x<GPIOPort::I, GPIOPin::_0> GPIO_I0;
        typedef GPIO_x<GPIOPort::I, GPIOPin::_1> GPIO_I1;
        typedef GPIO_x<GPIOPort::I, GPIOPin::_2> GPIO_I2;
        typedef GPIO_x<GPIOPort::I, GPIOPin::_3> GPIO_I3;
        typedef GPIO_x<GPIOPort::I, GPIOPin::_4> GPIO_I4;
        typedef GPIO_x<GPIOPort::I, GPIOPin::_5> GPIO_I5;
        typedef GPIO_x<GPIOPort::I, GPIOPin::_6> GPIO_I6;
        typedef GPIO_x<GPIOPort::I, GPIOPin::_7> GPIO_I7;
        typedef GPIO_x<GPIOPort::I, GPIOPin::_8> GPIO_I8;
        typedef GPIO_x<GPIOPort::I, GPIOPin::_9> GPIO_I9;
        typedef GPIO_x<GPIOPort::I, GPIOPin::_10> GPIO_I10;
        typedef GPIO_x<GPIOPort::I, GPIOPin::_11> GPIO_I11;
        typedef GPIO_x<GPIOPort::I, GPIOPin::_12> GPIO_I12;
        typedef GPIO_x<GPIOPort::I, GPIOPin::_13> GPIO_I13;
        typedef GPIO_x<GPIOPort::I, GPIOPin::_14> GPIO_I14;
        typedef GPIO_x<GPIOPort::I, GPIOPin::_15> GPIO_I15;
    #endif

    #ifdef GPIOJ_BASE
        typedef GPIO_x<GPIOPort::J, GPIOPin::_0> GPIO_J0;
        typedef GPIO_x<GPIOPort::J, GPIOPin::_1> GPIO_J1;
        typedef GPIO_x<GPIOPort::J, GPIOPin::_2> GPIO_J2;
        typedef GPIO_x<GPIOPort::J, GPIOPin::_3> GPIO_J3;
        typedef GPIO_x<GPIOPort::J, GPIOPin::_4> GPIO_J4;
        typedef GPIO_x<GPIOPort::J, GPIOPin::_5> GPIO_J5;
        typedef GPIO_x<GPIOPort::J, GPIOPin::_6> GPIO_J6;
        typedef GPIO_x<GPIOPort::J, GPIOPin::_7> GPIO_J7;
        typedef GPIO_x<GPIOPort::J, GPIOPin::_8> GPIO_J8;
        typedef GPIO_x<GPIOPort::J, GPIOPin::_9> GPIO_J9;
        typedef GPIO_x<GPIOPort::J, GPIOPin::_10> GPIO_J10;
        typedef GPIO_x<GPIOPort::J, GPIOPin::_11> GPIO_J11;
        typedef GPIO_x<GPIOPort::J, GPIOPin::_12> GPIO_J12;
        typedef GPIO_x<GPIOPort::J, GPIOPin::_13> GPIO_J13;
        typedef GPIO_x<GPIOPort::J, GPIOPin::_14> GPIO_J14;
        typedef GPIO_x<GPIOPort::J, GPIOPin::_15> GPIO_J15;
    #endif

    #ifdef GPIOK_BASE
        typedef GPIO_x<GPIOPort::K, GPIOPin::_0> GPIO_K0;
        typedef GPIO_x<GPIOPort::K, GPIOPin::_1> GPIO_K1;
        typedef GPIO_x<GPIOPort::K, GPIOPin::_2> GPIO_K2;
        typedef GPIO_x<GPIOPort::K, GPIOPin::_3> GPIO_K3;
        typedef GPIO_x<GPIOPort::K, GPIOPin::_4> GPIO_K4;
        typedef GPIO_x<GPIOPort::K, GPIOPin::_5> GPIO_K5;
        typedef GPIO_x<GPIOPort::K, GPIOPin::_6> GPIO_K6;
        typedef GPIO_x<GPIOPort::K, GPIOPin::_7> GPIO_K7;
        typedef GPIO_x<GPIOPort::K, GPIOPin::_8> GPIO_K8;
        typedef GPIO_x<GPIOPort::K, GPIOPin::_9> GPIO_K9;
        typedef GPIO_x<GPIOPort::K, GPIOPin::_10> GPIO_K10;
        typedef GPIO_x<GPIOPort::K, GPIOPin::_11> GPIO_K11;
        typedef GPIO_x<GPIOPort::K, GPIOPin::_12> GPIO_K12;
        typedef GPIO_x<GPIOPort::K, GPIOPin::_13> GPIO_K13;
        typedef GPIO_x<GPIOPort::K, GPIOPin::_14> GPIO_K14;
        typedef GPIO_x<GPIOPort::K, GPIOPin::_15> GPIO_K15;
    #endif


    #ifdef GPIOA_BASE
        template<>
        struct GPIOPortTrait<GPIOPort::A> {
            static constexpr uint32_t addr = GPIOA_BASE;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::A, GPIOPin::_0> {
            static constexpr uint32_t pn = 0;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::A, GPIOPin::_1> {
            static constexpr uint32_t pn = 1;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::A, GPIOPin::_3> {
            static constexpr uint32_t pn = 3;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::A, GPIOPin::_4> {
            static constexpr uint32_t pn = 4;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::A, GPIOPin::_5> {
            static constexpr uint32_t pn = 5;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::A, GPIOPin::_6> {
            static constexpr uint32_t pn = 6;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::A, GPIOPin::_7> {
            static constexpr uint32_t pn = 7;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::A, GPIOPin::_8> {
            static constexpr uint32_t pn = 8;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::A, GPIOPin::_9> {
            static constexpr uint32_t pn = 9;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::A, GPIOPin::_10> {
            static constexpr uint32_t pn = 10;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::A, GPIOPin::_11> {
            static constexpr uint32_t pn = 11;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::A, GPIOPin::_12> {
            static constexpr uint32_t pn = 12;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::A, GPIOPin::_13> {
            static constexpr uint32_t pn = 13;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::A, GPIOPin::_14> {
            static constexpr uint32_t pn = 14;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::A, GPIOPin::_15> {
            static constexpr uint32_t pn = 15;
        };
    #endif

    #ifdef GPIOB_BASE
        template  <>
        struct GPIOPortTrait<GPIOPort::B> {
            static constexpr uint32_t addr = GPIOB_BASE;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::B, GPIOPin::_0> {
            static constexpr uint32_t pn = 0;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::B, GPIOPin::_1> {
            static constexpr uint32_t pn = 1;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::B, GPIOPin::_2> {
            static constexpr uint32_t pn = 2;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::B, GPIOPin::_3> {
            static constexpr uint32_t pn = 3;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::B, GPIOPin::_4> {
            static constexpr uint32_t pn = 4;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::B, GPIOPin::_5> {
            static constexpr uint32_t pn = 5;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::B, GPIOPin::_6> {
            static constexpr uint32_t pn = 6;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::B, GPIOPin::_7> {
            static constexpr uint32_t pn = 7;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::B, GPIOPin::_8> {
            static constexpr uint32_t pn = 8;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::B, GPIOPin::_9> {
            static constexpr uint32_t pn = 9;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::B, GPIOPin::_10> {
            static constexpr uint32_t pn = 10;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::B, GPIOPin::_11> {
            static constexpr uint32_t pn = 11;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::B, GPIOPin::_12> {
            static constexpr uint32_t pn = 12;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::B, GPIOPin::_13> {
            static constexpr uint32_t pn = 13;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::B, GPIOPin::_14> {
            static constexpr uint32_t pn = 14;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::B, GPIOPin::_15> {
            static constexpr uint32_t pn = 15;
        };
    #endif

    #ifdef GPIOC_BASE
        template  <>
        struct GPIOPortTrait<GPIOPort::C> {
            static constexpr uint32_t addr = GPIOC_BASE;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::C, GPIOPin::_0> {
            static constexpr uint32_t pn = 0;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::C, GPIOPin::_1> {
            static constexpr uint32_t pn = 1;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::C, GPIOPin::_2> {
            static constexpr uint32_t pn = 2;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::C, GPIOPin::_3> {
            static constexpr uint32_t pn = 3;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::C, GPIOPin::_4> {
            static constexpr uint32_t pn = 4;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::C, GPIOPin::_5> {
            static constexpr uint32_t pn = 5;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::C, GPIOPin::_6> {
            static constexpr uint32_t pn = 6;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::C, GPIOPin::_7> {
            static constexpr uint32_t pn = 7;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::C, GPIOPin::_10> {
            static constexpr uint32_t pn = 10;
        };
    #endif

    #ifdef GPIOD_BASE
        template  <>
        struct GPIOPortTrait<GPIOPort::D> {
            static constexpr uint32_t addr = GPIOD_BASE;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::D, GPIOPin::_0> {
            static constexpr uint32_t pn = 0;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::D, GPIOPin::_1> {
            static constexpr uint32_t pn = 1;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::D, GPIOPin::_2> {
            static constexpr uint32_t pn = 2;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::D, GPIOPin::_3> {
            static constexpr uint32_t pn = 3;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::D, GPIOPin::_6> {
            static constexpr uint32_t pn = 6;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::D, GPIOPin::_7> {
            static constexpr uint32_t pn = 7;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::D, GPIOPin::_11> {
            static constexpr uint32_t pn = 11;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::D, GPIOPin::_12> {
            static constexpr uint32_t pn = 12;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::D, GPIOPin::_13> {
            static constexpr uint32_t pn = 13;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::D, GPIOPin::_14> {
            static constexpr uint32_t pn = 14;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::D, GPIOPin::_15> {
            static constexpr uint32_t pn = 15;
        };
    #endif

    #ifdef GPIOE_BASE
        template  <>
        struct GPIOPortTrait<GPIOPort::E> {
            static constexpr uint32_t addr = GPIOE_BASE;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::E, GPIOPin::_4> {
            static constexpr uint32_t pn = 4;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::E, GPIOPin::_5> {
            static constexpr uint32_t pn = 5;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::E, GPIOPin::_6> {
            static constexpr uint32_t pn = 6;
        };
    #endif

