Rafa350/EOS/v2/Include/HTL/STM32/htlGPIO.h
    #ifdef GPIOF_BASE
        template  <>
        struct GPIOPortTrait<GPIOPort::F> {
            static constexpr uint32_t addr = GPIOF_BASE;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::F, GPIOPin::_7> {
            static constexpr uint32_t pn = 7;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::F, GPIOPin::_9> {
            static constexpr uint32_t pn = 9;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::F, GPIOPin::_10> {
            static constexpr uint32_t pn = 10;
        };
    #endif

    #ifdef GPIOG_BASE
        template  <>
        struct GPIOPortTrait<GPIOPort::G> {
            static constexpr uint32_t addr = GPIOG_BASE;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::G, GPIOPin::_6> {
            static constexpr uint32_t pn = 6;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::G, GPIOPin::_7> {
            static constexpr uint32_t pn = 7;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::G, GPIOPin::_9> {
            static constexpr uint32_t pn = 9;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::G, GPIOPin::_10> {
            static constexpr uint32_t pn = 10;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::G, GPIOPin::_11> {
            static constexpr uint32_t pn = 11;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::G, GPIOPin::_12> {
            static constexpr uint32_t pn = 12;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::G, GPIOPin::_13> {
            static constexpr uint32_t pn = 13;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::G, GPIOPin::_14> {
            static constexpr uint32_t pn = 14;
        };
    #endif

    #ifdef GPIOH_BASE
        template  <>
        struct GPIOPortTrait<GPIOPort::H> {
            static constexpr uint32_t addr = GPIOH_BASE;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::H, GPIOPin::_0> {
            static constexpr uint32_t pn = 0;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::H, GPIOPin::_1> {
            static constexpr uint32_t pn = 1;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::H, GPIOPin::_2> {
            static constexpr uint32_t pn = 2;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::H, GPIOPin::_3> {
            static constexpr uint32_t pn = 3;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::H, GPIOPin::_4> {
            static constexpr uint32_t pn = 4;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::H, GPIOPin::_5> {
            static constexpr uint32_t pn = 5;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::H, GPIOPin::_6> {
            static constexpr uint32_t pn = 6;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::H, GPIOPin::_7> {
            static constexpr uint32_t pn = 7;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::H, GPIOPin::_8> {
            static constexpr uint32_t pn = 8;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::H, GPIOPin::_9> {
            static constexpr uint32_t pn = 9;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::H, GPIOPin::_10> {
            static constexpr uint32_t pn = 10;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::H, GPIOPin::_11> {
            static constexpr uint32_t pn = 11;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::H, GPIOPin::_12> {
            static constexpr uint32_t pn = 12;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::H, GPIOPin::_14> {
            static constexpr uint32_t pn = 14;
        };
    #endif

    #ifdef GPIOI_BASE
        template  <>
        struct GPIOPortTrait<GPIOPort::I> {
            static constexpr uint32_t addr = GPIOI_BASE;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::I, GPIOPin::_0> {
            static constexpr uint32_t pn = 0;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::I, GPIOPin::_1> {
            static constexpr uint32_t pn = 1;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::I, GPIOPin::_2> {
            static constexpr uint32_t pn = 2;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::I, GPIOPin::_3> {
            static constexpr uint32_t pn = 3;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::I, GPIOPin::_4> {
            static constexpr uint32_t pn = 4;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::I, GPIOPin::_5> {
            static constexpr uint32_t pn = 5;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::I, GPIOPin::_6> {
            static constexpr uint32_t pn = 6;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::I, GPIOPin::_9> {
            static constexpr uint32_t pn = 9;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::I, GPIOPin::_10> {
            static constexpr uint32_t pn = 10;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::I, GPIOPin::_11> {
            static constexpr uint32_t pn = 11;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::I, GPIOPin::_12> {
            static constexpr uint32_t pn = 12;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::I, GPIOPin::_13> {
            static constexpr uint32_t pn = 13;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::I, GPIOPin::_14> {
            static constexpr uint32_t pn = 14;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::I, GPIOPin::_15> {
            static constexpr uint32_t pn = 15;
        };
    #endif

    #ifdef GPIOJ_BASE
        template  <>
        struct GPIOPortTrait<GPIOPort::J> {
            static constexpr uint32_t addr = GPIOJ_BASE;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::J, GPIOPin::_0> {
            static constexpr uint32_t pn = 0;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::J, GPIOPin::_1> {
            static constexpr uint32_t pn = 1;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::J, GPIOPin::_2> {
            static constexpr uint32_t pn = 2;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::J, GPIOPin::_3> {
            static constexpr uint32_t pn = 3;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::J, GPIOPin::_4> {
            static constexpr uint32_t pn = 4;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::J, GPIOPin::_5> {
            static constexpr uint32_t pn = 5;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::J, GPIOPin::_6> {
            static constexpr uint32_t pn = 6;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::J, GPIOPin::_7> {
            static constexpr uint32_t pn = 7;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::J, GPIOPin::_8> {
            static constexpr uint32_t pn = 8;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::J, GPIOPin::_9> {
            static constexpr uint32_t pn = 9;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::J, GPIOPin::_10> {
            static constexpr uint32_t pn = 10;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::J, GPIOPin::_11> {
            static constexpr uint32_t pn = 11;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::J, GPIOPin::_13> {
            static constexpr uint32_t pn = 13;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::J, GPIOPin::_14> {
            static constexpr uint32_t pn = 14;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::J, GPIOPin::_15> {
            static constexpr uint32_t pn = 15;
        };
    #endif

    #ifdef GPIOK_BASE
        template  <>
        struct GPIOPortTrait<GPIOPort::K> {
            static constexpr uint32_t addr = GPIOK_BASE;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::K, GPIOPin::_0> {
            static constexpr uint32_t pn = 0;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::K, GPIOPin::_1> {
            static constexpr uint32_t pn = 1;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::K, GPIOPin::_2> {
            static constexpr uint32_t pn = 2;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::K, GPIOPin::_3> {
            static constexpr uint32_t pn = 3;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::K, GPIOPin::_4> {
            static constexpr uint32_t pn = 4;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::K, GPIOPin::_5> {
            static constexpr uint32_t pn = 5;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::K, GPIOPin::_6> {
            static constexpr uint32_t pn = 6;
        };

        template <>
        struct GPIOPinTrait<GPIOPort::K, GPIOPin::_7> {
            static constexpr uint32_t pn = 7;
        };
    #endif
}


#endif // __STM32_htlGPIO__

/// @}
/// @}
/// @}

